src/DataProcessors/ЗаполнениеПродукта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>ЗаполнениеПродукта</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовУУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовУУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродуктФильтр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовУУФильтр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовУУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Обновлять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обновлен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
								<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
								<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Продукт</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОперации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходовУУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиРасходовУУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Enums/ВидыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СчетНаОплатуПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияТоваровУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходныйКассовыйОрдер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходныйКассовыйОрдер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеНаРасчетныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеСРасчетногоСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеТоваровУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетНаОплатуПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеДопРасходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвансовыйОтчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОприходованиеТоваров</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/СчетНаОплатуПокупателю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СчетНаОплатуПокупателю</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовУУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовУУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/РеализацияТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>РеализацияТоваровУслуг</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовУУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовУУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ПриходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПриходныйКассовыйОрдер</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовУУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовУУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/РасходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>РасходныйКассовыйОрдер</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовУУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовУУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ПоступлениеНаРасчетныйСчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПоступлениеНаРасчетныйСчет</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовУУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовУУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/СписаниеСРасчетногоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СписаниеСРасчетногоСчета</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовУУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовУУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ПоступлениеТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПоступлениеТоваровУслуг</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовУУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовУУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/СчетНаОплатуПоставщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СчетНаОплатуПоставщика</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Продукт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Продукт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходовУУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиРасходовУУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/ЗаполнениеПродукта/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Функция ЗаполнитьНаСервере(НачалоПериода, КонецПериода, ВидДокумента, Организация, Подразделение, Договор, Комментарий, Продукт, СтатьяРасходовУУ)
	
	Запрос = Новый Запрос;
	
	МассивДокументов = Новый Массив;
	
	Если ВидДокумента = Перечисления.ВидыДокументов.СчетНаОплатуПокупателю тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетНаОплатуПокупателю.Ссылка КАК Ссылка,
		|	СчетНаОплатуПокупателю.Продукт КАК Продукт,                      
		|	СчетНаОплатуПокупателю.СтатьяРасходовУУ КАК СтатьяРасходовУУ,                      
		|	СчетНаОплатуПокупателю.Контрагент КАК Контрагент,		
		|	СчетНаОплатуПокупателю.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	СчетНаОплатуПокупателю.ПодразделениеОрганизации КАК ПодразделениеОрганизации, 
		|	NULL КАК ВидОперации,
		|	NULL КАК Субконто1,
		|	СчетНаОплатуПокупателю.СуммаДокумента КАК СуммаДокумента
		|ИЗ
		|	Документ.СчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
		|ГДЕ
		|	СчетНаОплатуПокупателю.Дата МЕЖДУ &НачалоПериода И &КонецПериода И СчетНаОплатуПокупателю.Организация = &Организация
		|	И СчетНаОплатуПокупателю.Проведен
		|	И НЕ СчетНаОплатуПокупателю.ПометкаУдаления";
		
		Если НЕ Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И СчетНаОплатуПокупателю.ПодразделениеОрганизации = &Подразделение";
			Запрос.УстановитьПараметр("Подразделение", Подразделение);
		КонецЕсли;
		
		Если НЕ СокрЛП(Договор) = "" тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И СчетНаОплатуПокупателю.ДоговорКонтрагента.Наименование ПОДОБНО &Договор";
			Запрос.УстановитьПараметр("Договор", "%"+Договор+"%");
		КонецЕсли;
		
		Если НЕ СокрЛП(Комментарий) = "" тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И СчетНаОплатуПокупателю.Комментарий ПОДОБНО &Комментарий";
			Запрос.УстановитьПараметр("Комментарий", "%"+Комментарий+"%");
		КонецЕсли;
		
		Если НЕ Продукт = Справочники.Продукт.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И СчетНаОплатуПокупателю.Продукт = &Продукт";
			Запрос.УстановитьПараметр("Продукт", Продукт);
		КонецЕсли;
		
		Если НЕ СтатьяРасходовУУ = Справочники.СтатьиРасходовУУ.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И СчетНаОплатуПокупателю.СтатьяРасходовУУ = &СтатьяРасходовУУ";
			Запрос.УстановитьПараметр("СтатьяРасходовУУ", СтатьяРасходовУУ);
		КонецЕсли;

		
		
	ИначеЕсли ВидДокумента = Перечисления.ВидыДокументов.РеализацияТоваровУслуг тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
		|	РеализацияТоваровУслуг.Продукт КАК Продукт, 
		|	РеализацияТоваровУслуг.СтатьяРасходовУУ КАК СтатьяРасходовУУ,
		|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
		|	РеализацияТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	РеализацияТоваровУслуг.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	Представление(РеализацияТоваровУслуг.ВидОперации) КАК ВидОперации,
		|	NULL КАК Субконто1,	
		|	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода И РеализацияТоваровУслуг.Организация = &Организация
		|	И РеализацияТоваровУслуг.Проведен
		|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления";
		
		Если НЕ Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И РеализацияТоваровУслуг.ПодразделениеОрганизации = &Подразделение";
			Запрос.УстановитьПараметр("Подразделение", Подразделение);
		КонецЕсли;
		
		Если НЕ СокрЛП(Договор) = "" тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И РеализацияТоваровУслуг.ДоговорКонтрагента.Наименование ПОДОБНО &Договор";
			Запрос.УстановитьПараметр("Договор", "%"+Договор+"%");
		КонецЕсли;
		
		Если НЕ СокрЛП(Комментарий) = "" тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И РеализацияТоваровУслуг.Комментарий ПОДОБНО &Комментарий";
			Запрос.УстановитьПараметр("Комментарий", "%"+Комментарий+"%");
		КонецЕсли;
		
		Если НЕ Продукт = Справочники.Продукт.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И РеализацияТоваровУслуг.Продукт = &Продукт";
			Запрос.УстановитьПараметр("Продукт", Продукт);
		КонецЕсли;
		
		Если НЕ СтатьяРасходовУУ = Справочники.СтатьиРасходовУУ.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И РеализацияТоваровУслуг.СтатьяРасходовУУ = &СтатьяРасходовУУ";
			Запрос.УстановитьПараметр("СтатьяРасходовУУ", СтатьяРасходовУУ);
		КонецЕсли;

		
		
		
	ИначеЕсли ВидДокумента = Перечисления.ВидыДокументов.ПриходныйКассовыйОрдер тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходныйКассовыйОрдер.Ссылка КАК Ссылка,
		|	ПриходныйКассовыйОрдер.Продукт КАК Продукт,
		|	ПриходныйКассовыйОрдер.СтатьяРасходовУУ КАК СтатьяРасходовУУ,
		|	ПриходныйКассовыйОрдер.Контрагент КАК Контрагент,
		|	ПриходныйКассовыйОрдер.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ПриходныйКассовыйОрдер.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	Представление(ПриходныйКассовыйОрдер.ВидОперации) КАК ВидОперации,
		|	Представление(ПриходныйКассовыйОрдер.СубконтоКт1) КАК Субконто1,	
		|	ПриходныйКассовыйОрдер.СуммаДокумента КАК СуммаДокумента
		|ИЗ
		|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
		|ГДЕ
		|	ПриходныйКассовыйОрдер.Дата МЕЖДУ &НачалоПериода И &КонецПериода И ПриходныйКассовыйОрдер.Организация = &Организация
		|	И ПриходныйКассовыйОрдер.Проведен
		|	И НЕ ПриходныйКассовыйОрдер.ПометкаУдаления";
		
		Если НЕ Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И ПриходныйКассовыйОрдер.ПодразделениеОрганизации = &Подразделение";
			Запрос.УстановитьПараметр("Подразделение", Подразделение);
		КонецЕсли;
		
		Если НЕ СокрЛП(Договор) = "" тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И ПриходныйКассовыйОрдер.ДоговорКонтрагента.Наименование ПОДОБНО &Договор";
			Запрос.УстановитьПараметр("Договор", "%"+Договор+"%");
		КонецЕсли;
		
		Если НЕ СокрЛП(Комментарий) = "" тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И ПриходныйКассовыйОрдер.Комментарий ПОДОБНО &Комментарий";
			Запрос.УстановитьПараметр("Комментарий", "%"+Комментарий+"%");
		КонецЕсли; 
		
		Если НЕ Продукт = Справочники.Продукт.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И ПриходныйКассовыйОрдер.Продукт = &Продукт";
			Запрос.УстановитьПараметр("Продукт", Продукт);
		КонецЕсли; 
		
		Если НЕ СтатьяРасходовУУ = Справочники.СтатьиРасходовУУ.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И ПриходныйКассовыйОрдер.СтатьяРасходовУУ = &СтатьяРасходовУУ";
			Запрос.УстановитьПараметр("СтатьяРасходовУУ", СтатьяРасходовУУ);
		КонецЕсли;
			
	ИначеЕсли ВидДокумента = Перечисления.ВидыДокументов.РасходныйКассовыйОрдер тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходныйКассовыйОрдер.Ссылка КАК Ссылка,
		|	РасходныйКассовыйОрдер.Продукт КАК Продукт,
		|	РасходныйКассовыйОрдер.СтатьяРасходовУУ КАК СтатьяРасходовУУ,
		|	РасходныйКассовыйОрдер.Контрагент КАК Контрагент,
		|	РасходныйКассовыйОрдер.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	РасходныйКассовыйОрдер.ПодразделениеОрганизации КАК ПодразделениеОрганизации, 
		|	Представление(РасходныйКассовыйОрдер.ВидОперации) КАК ВидОперации,
		|	Представление(РасходныйКассовыйОрдер.СубконтоДт1) КАК Субконто1,			
		|	РасходныйКассовыйОрдер.СуммаДокумента КАК СуммаДокумента
		|ИЗ
		|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
		|ГДЕ
		|	РасходныйКассовыйОрдер.Дата МЕЖДУ &НачалоПериода И &КонецПериода И РасходныйКассовыйОрдер.Организация = &Организация
		|	И РасходныйКассовыйОрдер.Проведен
		|	И НЕ РасходныйКассовыйОрдер.ПометкаУдаления";
		
		Если НЕ Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И РасходныйКассовыйОрдер.ПодразделениеОрганизации = &Подразделение";
			Запрос.УстановитьПараметр("Подразделение", Подразделение);
		КонецЕсли;
		
		Если НЕ СокрЛП(Договор) = "" тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И РасходныйКассовыйОрдер.ДоговорКонтрагента.Наименование ПОДОБНО &Договор";
			Запрос.УстановитьПараметр("Договор", "%"+Договор+"%");
		КонецЕсли;
		
		Если НЕ СокрЛП(Комментарий) = "" тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И РасходныйКассовыйОрдер.Комментарий ПОДОБНО &Комментарий";
			Запрос.УстановитьПараметр("Комментарий", "%"+Комментарий+"%");
		КонецЕсли; 
		
		Если НЕ Продукт = Справочники.Продукт.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И РасходныйКассовыйОрдер.Продукт = &Продукт";
			Запрос.УстановитьПараметр("Продукт", Продукт);
		КонецЕсли; 

		Если НЕ СтатьяРасходовУУ = Справочники.СтатьиРасходовУУ.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И РасходныйКассовыйОрдер.СтатьяРасходовУУ = &СтатьяРасходовУУ";
			Запрос.УстановитьПараметр("СтатьяРасходовУУ", СтатьяРасходовУУ);
		КонецЕсли;
		
	ИначеЕсли ВидДокумента = Перечисления.ВидыДокументов.ПоступлениеНаРасчетныйСчет тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеНаРасчетныйСчет.Ссылка КАК Ссылка,
		|	ПоступлениеНаРасчетныйСчет.Продукт КАК Продукт,
		|	ПоступлениеНаРасчетныйСчет.СтатьяРасходовУУ КАК СтатьяРасходовУУ,	
		|	ПоступлениеНаРасчетныйСчет.Контрагент КАК Контрагент,
		|	ПоступлениеНаРасчетныйСчет.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ПоступлениеНаРасчетныйСчет.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	Представление(ПоступлениеНаРасчетныйСчет.ВидОперации) КАК ВидОперации,
		|	Представление(ПоступлениеНаРасчетныйСчет.СубконтоКт1) КАК Субконто1,			
		|	ПоступлениеНаРасчетныйСчет.СуммаДокумента КАК СуммаДокумента
		|ИЗ
		|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
		|ГДЕ
		|	ПоступлениеНаРасчетныйСчет.Дата МЕЖДУ &НачалоПериода И &КонецПериода И ПоступлениеНаРасчетныйСчет.Организация = &Организация
		|	И ПоступлениеНаРасчетныйСчет.Проведен
		|	И НЕ ПоступлениеНаРасчетныйСчет.ПометкаУдаления";
		
		Если НЕ Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И ПоступлениеНаРасчетныйСчет.ПодразделениеОрганизации = &Подразделение";
			Запрос.УстановитьПараметр("Подразделение", Подразделение);
		КонецЕсли;
		
		Если НЕ СокрЛП(Договор) = "" тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И ПоступлениеНаРасчетныйСчет.ДоговорКонтрагента.Наименование ПОДОБНО &Договор";
			Запрос.УстановитьПараметр("Договор", "%"+Договор+"%");
		КонецЕсли;
		
		Если НЕ СокрЛП(Комментарий) = "" тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И ПоступлениеНаРасчетныйСчет.Комментарий ПОДОБНО &Комментарий";
			Запрос.УстановитьПараметр("Комментарий", "%"+Комментарий+"%");
		КонецЕсли; 
		
		Если НЕ Продукт = Справочники.Продукт.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И ПоступлениеНаРасчетныйСчет.Продукт = &Продукт";
			Запрос.УстановитьПараметр("Продукт", Продукт);
		КонецЕсли;
		
		Если НЕ СтатьяРасходовУУ = Справочники.СтатьиРасходовУУ.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И ПоступлениеНаРасчетныйСчет.СтатьяРасходовУУ = &СтатьяРасходовУУ";
			Запрос.УстановитьПараметр("СтатьяРасходовУУ", СтатьяРасходовУУ);
		КонецЕсли;
				
	ИначеЕсли ВидДокумента = Перечисления.ВидыДокументов.СписаниеСРасчетногоСчета тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписаниеСРасчетногоСчета.Ссылка КАК Ссылка,
		|	СписаниеСРасчетногоСчета.Продукт КАК Продукт,
		|	СписаниеСРасчетногоСчета.СтатьяРасходовУУ КАК СтатьяРасходовУУ,			
		|	СписаниеСРасчетногоСчета.Контрагент КАК Контрагент,
		|	СписаниеСРасчетногоСчета.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	СписаниеСРасчетногоСчета.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	Представление(СписаниеСРасчетногоСчета.ВидОперации) КАК ВидОперации,
		|	Представление(СписаниеСРасчетногоСчета.СубконтоДт1) КАК Субконто1,					
		|	СписаниеСРасчетногоСчета.СуммаДокумента КАК СуммаДокумента
		|ИЗ
		|	Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
		|ГДЕ
		|	СписаниеСРасчетногоСчета.Дата МЕЖДУ &НачалоПериода И &КонецПериода И СписаниеСРасчетногоСчета.Организация = &Организация
		|	И СписаниеСРасчетногоСчета.Проведен
		|	И НЕ СписаниеСРасчетногоСчета.ПометкаУдаления";
		
		Если НЕ Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И СписаниеСРасчетногоСчета.ПодразделениеОрганизации = &Подразделение";
			Запрос.УстановитьПараметр("Подразделение", Подразделение);
		КонецЕсли;
		
		Если НЕ СокрЛП(Договор) = "" тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И СписаниеСРасчетногоСчета.ДоговорКонтрагента.Наименование ПОДОБНО &Договор";
			Запрос.УстановитьПараметр("Договор", "%"+Договор+"%");
		КонецЕсли;
		
		Если НЕ СокрЛП(Комментарий) = "" тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И СписаниеСРасчетногоСчета.Комментарий ПОДОБНО &Комментарий";
			Запрос.УстановитьПараметр("Комментарий", "%"+Комментарий+"%");
		КонецЕсли; 
		
		Если НЕ Продукт = Справочники.Продукт.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И СписаниеСРасчетногоСчета.Продукт = &Продукт";
			Запрос.УстановитьПараметр("Продукт", Продукт);
		КонецЕсли;
		
		Если НЕ СтатьяРасходовУУ = Справочники.СтатьиРасходовУУ.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И СписаниеСРасчетногоСчета.СтатьяРасходовУУ = &СтатьяРасходовУУ";
			Запрос.УстановитьПараметр("СтатьяРасходовУУ", СтатьяРасходовУУ);
		КонецЕсли;		
		
	ИначеЕсли ВидДокумента = Перечисления.ВидыДокументов.ПоступлениеТоваровУслуг тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка,
		|	ПоступлениеТоваровУслуг.Продукт КАК Продукт,
		|	ПоступлениеТоваровУслуг.СтатьяРасходовУУ КАК СтатьяРасходовУУ,					
		|	ПоступлениеТоваровУслуг.Контрагент КАК Контрагент,
		|	ПоступлениеТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ПоступлениеТоваровУслуг.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
		|	Представление(ПоступлениеТоваровУслуг.ВидОперации) КАК ВидОперации,
		|	NULL КАК Субконто1,					
		|	ПоступлениеТоваровУслуг.СуммаДокумента КАК СуммаДокумента
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|ГДЕ
		|	ПоступлениеТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода И ПоступлениеТоваровУслуг.Организация = &Организация
		|	И ПоступлениеТоваровУслуг.Проведен
		|	И НЕ ПоступлениеТоваровУслуг.ПометкаУдаления";
		
		Если НЕ Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И ПоступлениеТоваровУслуг.ПодразделениеОрганизации = &Подразделение";
			Запрос.УстановитьПараметр("Подразделение", Подразделение);
		КонецЕсли;
		
		Если НЕ СокрЛП(Договор) = "" тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И ПоступлениеТоваровУслуг.ДоговорКонтрагента.Наименование ПОДОБНО &Договор";
			Запрос.УстановитьПараметр("Договор", "%"+Договор+"%");
		КонецЕсли;
		
		Если НЕ СокрЛП(Комментарий) = "" тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И ПоступлениеТоваровУслуг.Комментарий ПОДОБНО &Комментарий";
			Запрос.УстановитьПараметр("Комментарий", "%"+Комментарий+"%");
		КонецЕсли; 
		
		Если НЕ Продукт = Справочники.Продукт.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И ПоступлениеТоваровУслуг.Продукт = &Продукт";
			Запрос.УстановитьПараметр("Продукт", Продукт);
		КонецЕсли;
		
		Если НЕ СтатьяРасходовУУ = Справочники.СтатьиРасходовУУ.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И ПоступлениеТоваровУслуг.СтатьяРасходовУУ = &СтатьяРасходовУУ";
			Запрос.УстановитьПараметр("СтатьяРасходовУУ", СтатьяРасходовУУ);
		КонецЕсли;		
				
	ИначеЕсли ВидДокумента = Перечисления.ВидыДокументов.СчетНаОплатуПоставщика тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетНаОплатуПоставщика.Ссылка КАК Ссылка,
		|	СчетНаОплатуПоставщика.Продукт КАК Продукт,  
		|	СчетНаОплатуПоставщика.СтатьяРасходовУУ КАК СтатьяРасходовУУ,						
		|	СчетНаОплатуПоставщика.Контрагент КАК Контрагент,
		|	СчетНаОплатуПоставщика.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	СчетНаОплатуПоставщика.ПодразделениеОрганизации КАК ПодразделениеОрганизации, 
		|	NULL КАК ВидОперации,
		|	NULL КАК Субконто1,						
		|	СчетНаОплатуПоставщика.СуммаДокумента КАК СуммаДокумента
		|ИЗ
		|	Документ.СчетНаОплатуПоставщика КАК СчетНаОплатуПоставщика
		|ГДЕ
		|	СчетНаОплатуПоставщика.Дата МЕЖДУ &НачалоПериода И &КонецПериода И СчетНаОплатуПоставщика.Организация = &Организация
		|	И СчетНаОплатуПоставщика.Проведен
		|	И НЕ СчетНаОплатуПоставщика.ПометкаУдаления";
		
		Если НЕ Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И СчетНаОплатуПоставщика.ПодразделениеОрганизации = &Подразделение";
			Запрос.УстановитьПараметр("Подразделение", Подразделение);
		КонецЕсли;
		
		Если НЕ СокрЛП(Договор) = "" тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И СчетНаОплатуПоставщика.ДоговорКонтрагента.Наименование ПОДОБНО &Договор";
			Запрос.УстановитьПараметр("Договор", "%"+Договор+"%");
		КонецЕсли;
		
		Если НЕ СокрЛП(Комментарий) = "" тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И СчетНаОплатуПоставщика.Комментарий ПОДОБНО &Комментарий";
			Запрос.УстановитьПараметр("Комментарий", "%"+Комментарий+"%");
		КонецЕсли; 
		
		Если НЕ Продукт = Справочники.Продукт.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И СчетНаОплатуПоставщика.Продукт = &Продукт";
			Запрос.УстановитьПараметр("Продукт", Продукт);
		КонецЕсли;
		
		Если НЕ СтатьяРасходовУУ = Справочники.СтатьиРасходовУУ.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И СчетНаОплатуПоставщика.СтатьяРасходовУУ = &СтатьяРасходовУУ";
			Запрос.УстановитьПараметр("СтатьяРасходовУУ", СтатьяРасходовУУ);
		КонецЕсли;		
				
	ИначеЕсли ВидДокумента = Перечисления.ВидыДокументов.ПоступлениеДопРасходов тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеДопРасходов.Ссылка КАК Ссылка,
		|	ПоступлениеДопРасходов.Продукт КАК Продукт,
		|	ПоступлениеДопРасходов.СтатьяРасходовУУ КАК СтатьяРасходовУУ,							
		|	ПоступлениеДопРасходов.Контрагент КАК Контрагент,
		|	ПоступлениеДопРасходов.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	Null КАК ПодразделениеОрганизации, 
		|	NULL КАК ВидОперации,
		|	NULL КАК Субконто1,							
		|	ПоступлениеДопРасходов.СуммаДокумента КАК СуммаДокумента
		|ИЗ
		|	Документ.ПоступлениеДопРасходов КАК ПоступлениеДопРасходов
		|ГДЕ
		|	ПоступлениеДопРасходов.Дата МЕЖДУ &НачалоПериода И &КонецПериода И ПоступлениеДопРасходов.Организация = &Организация
		|	И ПоступлениеДопРасходов.Проведен
		|	И НЕ ПоступлениеДопРасходов.ПометкаУдаления";
		
		Если НЕ Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И ПоступлениеДопРасходов.ПодразделениеОрганизации = &Подразделение";
			Запрос.УстановитьПараметр("Подразделение", Подразделение);
		КонецЕсли;
		
		Если НЕ СокрЛП(Договор) = "" тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И ПоступлениеДопРасходов.ДоговорКонтрагента.Наименование ПОДОБНО &Договор";
			Запрос.УстановитьПараметр("Договор", "%"+Договор+"%");
		КонецЕсли;
		
		Если НЕ СокрЛП(Комментарий) = "" тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И ПоступлениеДопРасходов.Комментарий ПОДОБНО &Комментарий";
			Запрос.УстановитьПараметр("Комментарий", "%"+Комментарий+"%");
		КонецЕсли; 
		
		Если НЕ Продукт = Справочники.Продукт.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И ПоступлениеДопРасходов.Продукт = &Продукт";
			Запрос.УстановитьПараметр("Продукт", Продукт);
		КонецЕсли; 

		Если НЕ СтатьяРасходовУУ = Справочники.СтатьиРасходовУУ.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И ПоступлениеДопРасходов.СтатьяРасходовУУ = &СтатьяРасходовУУ";
			Запрос.УстановитьПараметр("СтатьяРасходовУУ", СтатьяРасходовУУ);
		КонецЕсли;		
		
	ИначеЕсли ВидДокумента = Перечисления.ВидыДокументов.АвансовыйОтчет тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвансовыйОтчет.Ссылка КАК Ссылка,
		|	АвансовыйОтчет.Продукт КАК Продукт, 
		|	АвансовыйОтчет.СтатьяРасходовУУ КАК СтатьяРасходовУУ,									
		|	NULL КАК Контрагент,
		|	NULL КАК ДоговорКонтрагента,
		|	АвансовыйОтчет.ПодразделениеОрганизации КАК ПодразделениеОрганизации, 
		|	АвансовыйОтчет.ВидОперации КАК ВидОперации,
		|	АвансовыйОтчет.Субконто1 КАК Субконто1,							
		|	АвансовыйОтчет.СуммаДокумента КАК СуммаДокумента
		|ИЗ
		|	Документ.АвансовыйОтчет КАК АвансовыйОтчет
		|ГДЕ
		|	АвансовыйОтчет.Дата МЕЖДУ &НачалоПериода И &КонецПериода И АвансовыйОтчет.Организация = &Организация
		|	И АвансовыйОтчет.Проведен
		|	И НЕ АвансовыйОтчет.ПометкаУдаления";
		
		Если НЕ Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И АвансовыйОтчет.ПодразделениеОрганизации = &Подразделение";
			Запрос.УстановитьПараметр("Подразделение", Подразделение);
		КонецЕсли;
		
		Если НЕ СокрЛП(Договор) = "" тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И АвансовыйОтчет.ДоговорКонтрагента.Наименование ПОДОБНО &Договор";
			Запрос.УстановитьПараметр("Договор", "%"+Договор+"%");
		КонецЕсли;
		
		Если НЕ СокрЛП(Комментарий) = "" тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И АвансовыйОтчет.Комментарий ПОДОБНО &Комментарий";
			Запрос.УстановитьПараметр("Комментарий", "%"+Комментарий+"%");
		КонецЕсли; 
		
		Если НЕ Продукт = Справочники.Продукт.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И АвансовыйОтчет.Продукт = &Продукт";
			Запрос.УстановитьПараметр("Продукт", Продукт);
		КонецЕсли;  
		
		Если НЕ СтатьяРасходовУУ = Справочники.СтатьиРасходовУУ.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И АвансовыйОтчет.СтатьяРасходовУУ = &СтатьяРасходовУУ";
			Запрос.УстановитьПараметр("СтатьяРасходовУУ", СтатьяРасходовУУ);
		КонецЕсли;				
		
ИначеЕсли ВидДокумента = Перечисления.ВидыДокументов.ОприходованиеТоваров тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОприходованиеТоваров.Ссылка КАК Ссылка,
		|	ОприходованиеТоваров.Продукт КАК Продукт,  
		|	ОприходованиеТоваров.СтатьяРасходовУУ КАК СтатьяРасходовУУ,											
		|	NULL КАК Контрагент,
		|	NULL КАК ДоговорКонтрагента,
		|	ОприходованиеТоваров.ПодразделениеОрганизации КАК ПодразделениеОрганизации, 
		|	NULL КАК ВидОперации,
		|	NULL КАК Субконто1,							
		|	ОприходованиеТоваров.СуммаДокумента КАК СуммаДокумента
		|ИЗ
		|	Документ.ОприходованиеТоваров КАК ОприходованиеТоваров
		|ГДЕ
		|	ОприходованиеТоваров.Дата МЕЖДУ &НачалоПериода И &КонецПериода И ОприходованиеТоваров.Организация = &Организация
		|	И ОприходованиеТоваров.Проведен
		|	И НЕ ОприходованиеТоваров.ПометкаУдаления";
		
		Если НЕ Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И ОприходованиеТоваров.ПодразделениеОрганизации = &Подразделение";
			Запрос.УстановитьПараметр("Подразделение", Подразделение);
		КонецЕсли;
				
		Если НЕ СокрЛП(Комментарий) = "" тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И ОприходованиеТоваров.Комментарий ПОДОБНО &Комментарий";
			Запрос.УстановитьПараметр("Комментарий", "%"+Комментарий+"%");
		КонецЕсли; 
		
		Если НЕ Продукт = Справочники.Продукт.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И ОприходованиеТоваров.Продукт = &Продукт";
			Запрос.УстановитьПараметр("Продукт", Продукт);
		КонецЕсли;
		
		Если НЕ СтатьяРасходовУУ = Справочники.СтатьиРасходовУУ.ПустаяСсылка() тогда 
			Запрос.Текст = Запрос.Текст + 
			"	И ОприходованиеТоваров.СтатьяРасходовУУ = &СтатьяРасходовУУ";
			Запрос.УстановитьПараметр("СтатьяРасходовУУ", СтатьяРасходовУУ);
		КонецЕсли;				
				
	Иначе
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураДокумента = Новый Структура;
		СтруктураДокумента.Вставить("Документ", ВыборкаДетальныеЗаписи.Ссылка);
		СтруктураДокумента.Вставить("ДатаДокумента", ВыборкаДетальныеЗаписи.Ссылка.Дата);	
		СтруктураДокумента.Вставить("Продукт", ВыборкаДетальныеЗаписи.Продукт);
		СтруктураДокумента.Вставить("СтатьяРасходовУУ", ВыборкаДетальныеЗаписи.СтатьяРасходовУУ);
		СтруктураДокумента.Вставить("Контрагент", ВыборкаДетальныеЗаписи.Контрагент);
		СтруктураДокумента.Вставить("Договор", ВыборкаДетальныеЗаписи.ДоговорКонтрагента);
		Если ВыборкаДетальныеЗаписи.ПодразделениеОрганизации = NULL тогда
			СтруктураДокумента.Вставить("Подразделение", Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
		Иначе	
			СтруктураДокумента.Вставить("Подразделение", ВыборкаДетальныеЗаписи.ПодразделениеОрганизации);
		КонецЕсли;	
		СтруктураДокумента.Вставить("ВидОперации", ВыборкаДетальныеЗаписи.ВидОперации); 
		СтруктураДокумента.Вставить("Субконто1", ВыборкаДетальныеЗаписи.Субконто1);
		СтруктураДокумента.Вставить("СуммаДокумента", ВыборкаДетальныеЗаписи.СуммаДокумента);
		МассивДокументов.Добавить(СтруктураДокумента);
	КонецЦикла;
	
	Возврат МассивДокументов;
	
КонецФункции

&НаКлиенте
Процедура Заполнить(Команда)
	МассивДокументов = ЗаполнитьНаСервере(Объект.НачалоПериода, Объект.КонецПериода, Объект.ВидДокумента, Объект.Организация, Объект.Подразделение, Объект.Договор, Объект.Комментарий, Объект.ПродуктФильтр, Объект.СтатьяРасходовУУФильтр);
	Объект.СписокДокументов.Очистить();
	Для Каждого СтруктураДокумента из МассивДокументов цикл
		СтрокаТЧ = Объект.СписокДокументов.Добавить();
		СтрокаТЧ.Документ = СтруктураДокумента.Документ;
		СтрокаТЧ.Продукт = СтруктураДокумента.Продукт;
		СтрокаТЧ.СтатьяРасходовУУ = СтруктураДокумента.СтатьяРасходовУУ;
		СтрокаТЧ.ДатаДокумента = СтруктураДокумента.ДатаДокумента;
		СтрокаТЧ.Контрагент = СтруктураДокумента.Контрагент;
		СтрокаТЧ.Договор = СтруктураДокумента.Договор;
 		СтрокаТЧ.Подразделение = СтруктураДокумента.Подразделение;
		СтрокаТЧ.СуммаДокумента = СтруктураДокумента.СуммаДокумента; 
		СтрокаТЧ.ВидОперации = СтруктураДокумента.ВидОперации;
		СтрокаТЧ.Субконто1 = СтруктураДокумента.Субконто1;
	КонецЦикла;
	
	Объект.СписокДокументов.Сортировать("ДатаДокумента Возр");
	
КонецПроцедуры

&НаСервере
Функция ОбновитьНаСервере(Документ, Продукт, ВидДокумента)
	
	Рез = Ложь;
	
	Если ВидДокумента = Перечисления.ВидыДокументов.СчетНаОплатуПокупателю тогда
		ДокСсылка = Документы.СчетНаОплатуПокупателю.ПолучитьСсылку(Документ.УникальныйИдентификатор());
	ИначеЕсли ВидДокумента = Перечисления.ВидыДокументов.РеализацияТоваровУслуг тогда
		ДокСсылка = Документы.РеализацияТоваровУслуг.ПолучитьСсылку(Документ.УникальныйИдентификатор());
	ИначеЕсли ВидДокумента = Перечисления.ВидыДокументов.ПриходныйКассовыйОрдер тогда
		ДокСсылка = Документы.ПриходныйКассовыйОрдер.ПолучитьСсылку(Документ.УникальныйИдентификатор());
	ИначеЕсли ВидДокумента = Перечисления.ВидыДокументов.РасходныйКассовыйОрдер тогда
		ДокСсылка = Документы.РасходныйКассовыйОрдер.ПолучитьСсылку(Документ.УникальныйИдентификатор());
	ИначеЕсли ВидДокумента = Перечисления.ВидыДокументов.ПоступлениеНаРасчетныйСчет тогда
		ДокСсылка = Документы.ПоступлениеНаРасчетныйСчет.ПолучитьСсылку(Документ.УникальныйИдентификатор());
	ИначеЕсли ВидДокумента = Перечисления.ВидыДокументов.СписаниеСРасчетногоСчета тогда
		ДокСсылка = Документы.СписаниеСРасчетногоСчета.ПолучитьСсылку(Документ.УникальныйИдентификатор());
	ИначеЕсли ВидДокумента = Перечисления.ВидыДокументов.ПоступлениеТоваровУслуг тогда
		ДокСсылка = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Документ.УникальныйИдентификатор());
	ИначеЕсли ВидДокумента = Перечисления.ВидыДокументов.СчетНаОплатуПоставщика тогда
		ДокСсылка = Документы.СчетНаОплатуПоставщика.ПолучитьСсылку(Документ.УникальныйИдентификатор());
	ИначеЕсли ВидДокумента = Перечисления.ВидыДокументов.ПоступлениеДопРасходов тогда
		ДокСсылка = Документы.ПоступлениеДопРасходов.ПолучитьСсылку(Документ.УникальныйИдентификатор());
	ИначеЕсли ВидДокумента = Перечисления.ВидыДокументов.АвансовыйОтчет тогда
		ДокСсылка = Документы.АвансовыйОтчет.ПолучитьСсылку(Документ.УникальныйИдентификатор());
	ИначеЕсли ВидДокумента = Перечисления.ВидыДокументов.ОприходованиеТоваров тогда
		ДокСсылка = Документы.ОприходованиеТоваров.ПолучитьСсылку(Документ.УникальныйИдентификатор());				
	Иначе
		Рез = Ложь;
	КонецЕсли;
	
	Попытка
		Док = ДокСсылка.ПолучитьОбъект();
		Док.Продукт = Продукт;
		Док.Записать(РежимЗаписиДокумента.Запись);
		Рез = Истина;
	Исключение
		Рез = Ложь;
	КонецПопытки;
	
	Возврат Рез;
	
КонецФункции

&НаКлиенте
Процедура Обновить(Команда)
	
	Для Каждого СтрокаТЧ из Объект.СписокДокументов Цикл
		
		Если НЕ СтрокаТЧ.Обновлять тогда продолжить;
		КонецЕсли;	
		
		ДокументОбновлен = ОбновитьНаСервере(СтрокаТЧ.Документ, Объект.Продукт, Объект.ВидДокумента);
		Если ДокументОбновлен тогда
			СтрокаТЧ.Продукт = Объект.Продукт;
			СтрокаТЧ.Обновлен = Истина;
			Сообщить("Обработан документ: " + Строка(СтрокаТЧ.Документ));
		Иначе
			Сообщить("Не удалось записать документ: " + Строка(СтрокаТЧ.Документ) + ". Возможно он находится в закрытом периоде.");
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсе(Команда)
	
	МассивСтрок = Элементы.СписокДокументов.ВыделенныеСтроки;
	
	Для Каждого Стр Из МассивСтрок Цикл
		ТекСтр = Объект.СписокДокументов.НайтиПоИдентификатору(Стр);    
		ТекСтр.Обновлять = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВыделениеВсех(Команда)
	
	МассивСтрок = Элементы.СписокДокументов.ВыделенныеСтроки;
	
	Для Каждого Стр Из МассивСтрок Цикл
		ТекСтр = Объект.СписокДокументов.НайтиПоИдентификатору(Стр);    
		ТекСтр.Обновлять = Ложь;
	КонецЦикла;
	
КонецПроцедуры
